Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: To be able to do the above, the `Phone` object needs to have a constructor that takes a String (or `Int` / `Date` / etc.), or have a setter method for the String (or `Int` / `Date` / etc.), or have a `fromString` (or `fromInt` / `fromDate` - depending on the Scalar type) static method.
ja_jp: 上記の操作を行うためには、 `Phone` オブジェクトは、文字列（または `Int` / `Date` など）を受け取るコンストラクタを持つか、文字列（または `Int` / `Date` など）のセッターメソッドを持つか、 `fromString` (または `fromInt` / `fromDate` - スカラーの型に依存）のスタティックメソッドを持つ必要があります。

source: To be able to easily identify Quarkus platform descriptors among the project's dependency constraints, the platform descriptor Maven artifact coordinates should follow the following naming convention:
ja_jp: プロジェクトの依存性制約の中でQuarkusプラットフォームディスクリプタを簡単に識別できるように、プラットフォームディスクリプタのMavenアーティファクト座標は、以下の命名規則に従う必要があります。

source: To be able to make use of visual modelling of your processes, download Eclipse IDE and install from Marketplace Eclipse BPMN2 Modeller plugin (with jBPM Runtime Extension)
ja_jp: プロセスのビジュアル・モデリングを利用するには、Eclipse IDEをダウンロードし、MarketplaceからEclipse BPMN2 Modellerプラグイン（with jBPM Runtime Extension）をインストールします。

source: To be able to set properties with the same name, each property needs to be prefixed with a percentage sign `%` followed by the profile name and a dot `.` in the syntax `%{profile-name}.config.name`:
ja_jp: 同じ名前のプロパティーを設定できるようにするには、各プロパティーは、 `%{profile-name}.config.name` の構文で、プロファイル名とドット `.` の前にパーセント記号 `%` を付ける必要があります。

source: To be able to set the address per message, the connector is using an _anonymous sender_.
ja_jp: メッセージごとにアドレスを設定できるようにするために、コネクターは _anonymous sender_ を使用しています。

source: To be able to use Test Scenario assets in your application, an additional dependency is required:
ja_jp: テストシナリオアセットをアプリケーションで使用するためには、追加の依存関係が必要です:

source: To be able to use this with a programmatically created GraphQL client, both builders (`VertxDynamicGraphQLClientBuilder` and `VertxTypesafeGraphQLClientBuilder`) contain a method `dynamicHeader(String, Uni<String>`) that allows you to plug in a header that might change for every request. To plug an OIDC client into it, use
ja_jp: これをプログラムで作成された GraphQL クライアントで使用できるようにするために、 両方のビルダー (`VertxDynamicGraphQLClientBuilder` と `VertxTypesafeGraphQLClientBuilder`) は `dynamicHeader(String, Uni<String>`) メソッドを含んでおり、変更される可能性のあるヘッダーをプラグインできます。 OIDC クライアントを接続するには、以下を使用します。

source: To be precise: you cannot use custom class loaders to load **classes** if you want to fully benefit from AOT caching. However, you can still use a custom class loader for loading **resources** only.
ja_jp: 正確には、AOT キャッシュを最大限に活用したい場合、**クラス** をロードするためにカスタムクラスローダーを使用することはできません。ただし、**リソース** のロードのみを目的としてカスタムクラスローダーを使用することはできます。

source: To be sure it's extra clear that you don't need an extension to add a Servlet to your application. This guide is a simplified example to explain the concepts of extensions development, see the xref:writing-extensions.adoc[full documentation] if you need more information. Keep in mind it's not representative of the power of moving things to build time or simplifying the build of native images.
ja_jp: 念のため、アプリケーションにサーブレットを追加するのにエクステンションは必要ないことを明確にしておきます。このガイドは、エクステンション開発の概念を説明するための簡略化された例であり、より詳しい情報が必要な場合は xref:writing-extensions.adoc[完全なドキュメント] を参照してください。ビルド時に処理を移動したり、ネイティブイメージのビルドを簡素化したりする機能の強力さを代表するものではないことに留意してください。

source: To be sure it's extra clear you don't need an extension to add a Servlet to your application. This guide is a simplified example to explain the concepts of extensions development, see the xref:writing-extensions.adoc[full documentation] if you need more information. Keep in mind it's not representative of the power of moving things to build time or simplifying the build of native images.
ja_jp: 念のため、アプリケーションにサーブレットを追加するのにエクステンションは必要ないことを明記しておきます。このガイドは、エクステンション開発のコンセプトを説明するための簡略化された例であり、より詳細な情報が必要な場合は、 link:writing-extensions.html[完全なドキュメント]を参照してください。処理をビルド時に移動したり、ネイティブイメージのビルドを簡単にしたりする機能を代表するものではありませんのでご注意ください。

source: To better understand the contrast, we need to explain the difference between the reactive and imperative execution models. It's essential to comprehend that _Reactive_ is not just a different execution model, but that distinction is necessary to understand this guide.
ja_jp: この対比をよりよく理解するためには、リアクティブ型と命令型の実行モデルの違いを説明する必要があります。 _リアクティブ_ は単なる実行モデルの違いではなく、このガイドを理解するためにはその区別が必要であることを理解しておく必要があります。

source: To better understand, let's detail how the HTTP request/response has been handled:
ja_jp: より理解しやすくするために、HTTP リクエスト/レスポンスがどのように処理されたかを詳しく見てみます。

source: To block or not to block, that is the question.
ja_jp: ブロックするかしないか、それが問題だ。

source: To bridge datastores that consume credentials, which can take different forms, and secure stores that provide those credentials, Quarkus introduces an intermediate abstraction called `Credentials Provider`, that some extensions may support to consume credentials (e.g. `agroal`), and some others may implement to produce credentials (e.g. `vault`).
ja_jp: さまざまな形式をとることができるクレデンシャルを消費するデータストアと、それらのクレデンシャルを提供する安全なストアの橋渡しをするために、Quarkusでは、 `Credentials Provider` と呼ばれる中間的な抽象化を導入しています。これは、一部のエクステンションがクレデンシャルを消費するためにサポートしている場合もあれば(例: `agroal` )、クレデンシャルを生成するために実装している場合もあります(例: `vault` )。

source: To build a JAX-RS application with LRA support add the dependency `io.quarkus:quarkus-narayana-lra` to your application's pom. This will add JAX-RS support and will also make the LRA annotations available when developing your services, it also registers a JAX-RS filter that automatically manages the participation of your services in LRAs.
ja_jp: LRAをサポートするJAX-RSアプリケーションをビルドするには、アプリケーションのpomに依存関係 `io.quarkus:quarkus-narayana-lra` を追加します。これにより、JAX-RSサポートが追加され、サービスを開発する際にLRAアノテーションを利用できるようになります。また、LRAへのサービスの参加を自動的に管理するJAX-RSフィルタも登録されます。

source: To build a Quarkus application with AOT caching enabled:
ja_jp: AOT キャッシングを有効にして Quarkus アプリケーションをビルドするには、以下のようにします。

source: To build a container image for your project, `quarkus.container-image.build=true` needs to be set using any of the ways that Quarkus supports.
ja_jp: プロジェクト用のコンテナーイメージを作成するには、Quarkus がサポートしている方法のいずれかで、 `quarkus.container-image.build=true` を設定する必要があります。

source: To build a container running a Quarkus application using virtual threads compiled into a native executable, you must make sure you have a Linux/AMD64 executable (or ARM64 if you are targeting ARM machines).
ja_jp: ネイティブ実行可能ファイルにコンパイルされた仮想スレッドを使用して Quarkus アプリケーションを実行するコンテナーをビルドするには、 Linux/AMD64 実行ファイル (ARM マシンを対象としている場合はARM64) を用意する必要があります。

source: To build a native executable with Docker:
ja_jp: Docker を使用してネイティブ実行可能ファイルをビルドするには:

source: To build a native executable with Podman:
ja_jp: Podman を使用してネイティブ実行可能ファイルをビルドするには:

source: To build an application using the `aot-jar` packaging, use the following:
ja_jp: `aot-jar` パッケージングを使用してアプリケーションをビルドするには、以下を使用します。

source: To build an interactive page with actions and runtime (or build time) data, you must use the web component page:
ja_jp: アクションとランタイム (またはビルド時) データを含むインタラクティブページをビルドするには、Web コンポーネントページを使用する必要があります。

source: To build and deploy your applications as a container image that runs inside your {openshift} cluster, you must add the {project-name} OpenShift extension `quarkus-openshift` as a dependency to your project.
ja_jp: アプリケーションを {openshift} クラスタ内で動作するコンテナイメージとしてビルドしてデプロイするには、 {project-name} OpenShift extension `quarkus-openshift` を依存関係としてプロジェクトに追加する必要があります。

source: To build the project, create the application, and deploy the {openshift} service, enter the following command:
ja_jp: プロジェクトをビルドし、アプリケーションを作成し、{openshift}サービスをデプロイするには、以下のコマンドを入力します：

source: To build your application, you can package it using the standard command:
ja_jp: アプリケーションを構築するには、標準コマンドを使ってパッケージ化します。

source: To build your application, you can package your application via `mvn clean package`. You will have a single JAR inside the `target/deployment` repository that contains your classes and all your dependencies in it.
ja_jp: アプリケーションをビルドするには、 `mvn clean package` からアプリケーションをパッケージ化することができます。 `target/deployment` リポジトリー内には、クラスとすべての依存関係が含まれた単一の JAR があります。

source: To build your project using the Quarkus CLI (using the default configuration in this example), use the `build` command:
ja_jp: Quarkus CLI を使用してプロジェクトをビルドするには (この例ではデフォルト設定を使用)、 `build` コマンドを使用します。

source: To cache a query, mark it as cacheable on the `Query` instance:
ja_jp: クエリをキャッシュするには、 `Query` インスタンス上でキャッシュ可能なものとしてマークします:

source: To calculate the score, you could implement an `EasyScoreCalculator` class:
ja_jp: スコアを計算するには、 `EasyScoreCalculator` クラスを実装します。

source: To call an anchor created in a different file, insert the anchor to an `xref` macro and specify the full name of the hosting file and the desired anchored ID.
ja_jp: 別のファイルで作成されたアンカーを呼び出すには、アンカーを `xref` マクロに挿入し、ホスティングファイルの完全な名前と目的のアンカー ID を指定します。

source: To call an anchor created in the same file, insert the anchored ID in a `<<>>` xref macro.
ja_jp: 同じファイルに作成されたアンカーを呼び出すには、 `<<>>` xref マクロにアンカーIDを挿入してください。

source: To call an anchored ID from a different file, use the full file name and anchored ID separated by `#`, and specify the human-readable URL caption.
ja_jp: 別のファイルからアンカー付きIDを呼び出すには、完全なファイル名とアンカー付きIDを `#` で区切って使い、人間が読めるURLキャプションを指定してください。

source: To change any of the default property values, here is an example on how to configure the default OTLP gRPC Exporter within the application, using the `src/main/resources/application.properties` file:
ja_jp: デフォルトのプロパティ値を変更するために、 `src/main/resources/application.properties` ファイルを使用して、アプリケーション内でデフォルトの OTLP gRPC Exporter を設定する方法の例を以下に示します:

source: To change the `wait-for` image for a particular init container (e.g. `wait-for-flway`) you can use:
ja_jp: 特定の init コンテナ（例： `wait-for-flway` ）の `wait-for` イメージを変更するには、次のようにします:

source: To change the `wait-for` image for a particular init container (e.g. one that waits for the `flyway` job), you can use:
ja_jp: 特定の init コンテナ（たとえば、 `flyway` ジョブを待機するもの）の `wait-for` イメージを変更するには、次のようにします：

source: To change the `wait-for` image which by default is `groundnuty/k8s-wait-for:no-root-v1.7` you can use:
ja_jp: デフォルトでは `groundnuty/k8s-wait-for:no-root-v1.7` である `wait-for` イメージを変更するには、次を使用できます。

source: To change the default endpoint:
ja_jp: デフォルトのエンドポイントを変更するには、以下のようにします。

source: To change the number of replicas from 1 to 3:
ja_jp: レプリカ数を1から3に変更するためには次のようにします。

source: To check if you can use `io_uring` on your Linux machine, execute the following command:
ja_jp: Linuxマシンで `io_uring` が使用できるかどうかを確認するには、以下のコマンドを実行してください：

source: To check that the `smallrye-health` extension is working as expected:
ja_jp: `smallrye-health` エクステンションが期待通りに動作しているかのチェックをします:

source: To clear the test results area, use the eraser icon in the lower right corner.
ja_jp: テスト結果領域を消去するには、右下隅にある消しゴムアイコンを使用します。

source: To comment scroll to the bottom of any blog entry, click "Login with GitHub" and follow the instructions and you can now post a comment. This feature is implemented using GitHub Discussions so you will see them show up in https://github.com/quarkusio/quarkus/discussions[GitHub Discussion] category named https://github.com/quarkusio/quarkus/discussions/categories/quarkus-blog-website[Quarkus Blog/Website]
ja_jp: コメントをするには、ブログエントリーの一番下までスクロールし、"Login with GitHub"をクリックして指示に従うと、コメントを投稿することができます。この機能はGitHub Discussionsを使用して実装されているため、 link:https://github.com/quarkusio/quarkus/discussions[GitHub Discussion]の link:https://github.com/quarkusio/quarkus/discussions/categories/quarkus-blog-website[Quarkus Blog/Website]というカテゴリに表示されます。

source: To compile a Quarkus applications leveraging `@RunOnVirtualThread` into a native executable, you must be sure to use a GraalVM / Mandrel `native-image` supporting virtual threads, so providing at least Java 21.
ja_jp: `@RunOnVirtualThread` を活用した Quarkus アプリケーションをネイティブ実行可能ファイルにコンパイルするには、仮想スレッドをサポートする GraalVM/Mandrel `native-image` を使用する必要があり、少なくとも Java 21 を提供する必要があります。

source: To complete this guide, you need:
ja_jp: このガイドを完成させるには、以下が必要です:

source: To compress your executable, you need to configure the compression level. The compression goes from 1 to 10:
ja_jp: 実行可能ファイルを圧縮するには、圧縮レベルを設定する必要があります。圧縮率は1から10まであります。

source: To compute the list of classes, we recommend deploying your function and setting the `JAVA_TOOL_OPTIONS` environment variable to `-verbose:class`. Then execute your function and retrieve the log (in CloudWatch). You should be able to extract the class names using sed/awk or any text editor.
ja_jp: クラスのリストを計算するには、関数をデプロイして、環境変数 `JAVA_TOOL_OPTIONS` を `-verbose:class` に設定することをお勧めします。 その後、関数を実行し、（CloudWatchで）ログを取得します。sed/awkなどのテキストエディタでクラス名を抽出することができるはずです。

source: To conditionally render assistant UI in your Web Component, you can use the xref:dev-ui.adoc#assistant-state[assistant state] to check the state of the assistant. The state can be:
ja_jp: Web コンポーネントでアシスタント UI を条件付きでレンダリングするには、 xref:dev-ui.adoc#assistant-state[アシスタントの状態] を使用してアシスタントの状態を確認できます。状態は以下のいずれかになります。

source: To configure a JKS keystore:
ja_jp: JKS キーストアを設定するには、次のように指定します。

source: To configure a JKS truststore:
ja_jp: JKS トラストストアを設定するには、次のように指定します。

source: To configure a PEM keystore:
ja_jp: PEM キーストアを設定するには、次のように指定します。

source: To configure a PEM truststore:
ja_jp: PEM トラストストアを設定するには、次のように指定します。

source: To configure a PKCS12 keystore:
ja_jp: PKCS12 キーストアを設定するには、次のように指定します。

source: To configure a PKCS12 truststore:
ja_jp: PKCS12 トラストストアを設定するには、次のように指定します。

source: To configure a TLS connection for the Keycloak Admin Client, use the TLS Registry extension and point the Keycloak Admin Client to respective TLS configuration. For example, you can configure mutual TLS (mTLS) like this:
ja_jp: Keycloak管理クライアントにTLS接続を設定するには、TLSレジストリエクステンションを使用して、Keycloak管理クライアントにそれぞれのTLS設定を指定します。 例えば、次のように相互TLS（mTLS）を設定できます：

source: To configure a TLS connection, including key and truststores, use the `+quarkus.tls.*+` properties. These properties are required for:
ja_jp: キーとトラストストアを含む TLS 接続を設定するには、`+quarkus.tls.*+` プロパティーを使用します。 これらのプロパティーは次の場合に必要です。

source: To configure a `Vault Credentials Provider` you need to provide the following properties:
ja_jp: `Vault Credentials Provider` を設定するには、以下のプロパティーを提供する必要があります。

source: To configure a credential provider:
ja_jp: 認証情報プロバイダーを設定するには、次のように指定します。

source: To configure a credentials provider for proxy authentication, use the following properties:
ja_jp: プロキシー認証用のクレデンシャルプロバイダーを設定するには、次のプロパティーを使用します。

source: To configure a default (global) proxy, add the following properties to `application.properties`:
ja_jp: デフォルト (グローバル) プロキシーを設定するには、`application.properties` に以下のプロパティーを追加します。

source: To configure a production service but continue to use Dev Services in development and test modes, use xref:config-reference.adoc#default-profiles[configuration profiles].
ja_jp: 本番サービスを構成する一方で、開発モードとテスト・モードでは Dev Services を引き続き使用するには、 xref:config-reference.adoc#default-profiles[設定プロファイル] を使用してください。

source: To configure automatic certificate renewal, use the periodic reloading mechanism:
ja_jp: 証明書の自動更新を設定するには、定期的なリロードメカニズムを使用します。

source: To configure periodic certificate reloading:
ja_jp: 定期的な証明書の再読み込みを設定するには、次のように指定します。

source: To configure the CRL:
ja_jp: CRL を設定するには、次のように指定します。

source: To configure the Dev Service launch process, your build step can accept a `ConfigPhase.BUILD_TIME` config class in its constructor. For example,
ja_jp: Dev Service の起動プロセスを設定するには、ビルドステップのコンストラクターで `ConfigPhase.BUILD_TIME` 設定クラスを受け入れます。 以下に例を示します。

source: To configure the HTTP server to use HTTPS, you can use the following configuration:
ja_jp: HTTPS を使用するために HTTP サーバーを設定するには、次の設定を使用できます。

source: To configure the Keycloak server from your application by using the Keycloak Admin Client, include one of the following extensions based on your setup:
ja_jp: Keycloak Admin Client を使用してアプリケーションから Keycloak サーバーを設定するには、セットアップに基づいて次のいずれかのエクステンションを含めます。

source: To configure the TLS for a channel, you need to provide a named TLS configuration in the `application.properties`:
ja_jp: チャネルのTLSを設定するには、 `application.properties` で名前付きTLS設定を提供する必要があります：

source: To configure the TLS for an AMQP 1.0 channel, you need to provide a named TLS configuration in the `application.properties`:
ja_jp: AMQP 1.0 チャネルの TLS を設定するには、 `application.properties` に TLS 設定を指定します：

source: To configure the TLS for the default Kafka configuration, you need to provide a named TLS configuration in the `application.properties`:
ja_jp: デフォルトの Kafka 設定の TLS を設定するには、 `application.properties` で名前付き TLS 設定を指定する必要があります。

source: To configure the `ValidatorFactory`, use the exposed configuration properties and the CDI integration.
ja_jp: `ValidatorFactory` を設定するには、公開された設定プロパティとCDI統合を使用します。

source: To configure the application you can use the `application.properties` file as usual, but you need to _add_ it to the script:
ja_jp: アプリケーションを設定するには、通常どおり `application.properties` ファイルを使用できますが、スクリプトに _追加_ する必要があります。

source: To configure the cipher suites:
ja_jp: 暗号スイートを設定するには、次のように指定します。

source: To configure the connection using the same properties for all signals, please check the base xref:opentelemetry.adoc#create-the-configuration[configuration section of the OpenTelemetry guide].
ja_jp: すべての信号に対して同じプロパティーを使用して接続を設定するには、ベースの xref:opentelemetry.adoc#create-the-configuration[OpenTelemetry ガイドの設定セクション] を確認してください。

source: To configure the inbound connector to use the provided listener, we either set the consumer rebalance listener’s identifier: `mp.messaging.incoming.rebalanced-example.consumer-rebalance-listener.name=rebalanced-example.rebalancer`
ja_jp: 提供されたリスナーを使用するようにインバウンドコネクターを設定するには、コンシューマリバランスリスナーの識別子を設定します: `mp.messaging.incoming.rebalanced-example.consumer-rebalance-listener.name=rebalanced-example.rebalancer`

source: To configure the incoming channel `users` with defined schema, you need to set the `schema` property to the identifier of the schema `user-schema`:
ja_jp: 定義されたスキーマを使用して着信チャネル `users` を設定するには、 `schema` プロパティーをスキーマ `user-schema` の識別子に設定する必要があります。

source: To configure the mTLS for a Pulsar channel, you need to provide a named TLS configuration in the `application.properties`:
ja_jp: パルサー・チャンネルにmTLSを設定するには、 `application.properties` に名前付きTLS設定を提供する必要があります:

source: To configure the name of the function, you can use the following configuration property:
ja_jp: Cloud Functions の関数に名前を設定するには、以下の設定プロパティーを使用します。

source: To configure the outbound `movies-out` channel, we use the `mp.messaging.outgoing.movies-out` prefix. In addition to indicate who's responsible for that channel, we also need to configure the key and value serializers.
ja_jp: アウトバウンド `movies-out` チャネルを設定するには、 `mp.messaging.outgoing.movies-out` のプレフィックスを使用します。そのチャネルを担当するコネクタを示すだけでなく、キーと値のシリアライザも設定する必要があります。

source: To configure the outbound `movies-out` channel, we use the `mp.messaging.outgoing.movies-out` prefix. In addition to indicating who's responsible for that channel, we also need to configure the address.
ja_jp: アウトバウンド `movies-out` チャネルを設定するには、 `mp.messaging.outgoing.movies-out` プレフィックスを使用します。そのチャネルを担当するコネクタを示すだけでなく、アドレスも設定する必要があります。

source: To configure the protected routes by using the `@RolesAllowed` annotation or the `application.properties` file, check the xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) Bearer token authentication] and xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints] guides. For more details, check the xref:security-overview.adoc[Quarkus Security overview].
ja_jp: `@RolesAllowed` アノテーションまたは `application.properties` ファイルを使用して保護されたルートを設定するには、xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) ベアラートークン認証] および xref:security-authorize-web-endpoints-reference.adoc[Web エンドポイントの認可] ガイドを確認してください。 詳細は、xref:security-overview.adoc[Quarkus セキュリティーの概要] を参照してください。

source: To configure the protected routes using the `@RolesAllowed` annotation or the `application.properties` file, check the xref:security-openid-connect.adoc[Using OpenID Connect Adapter to Protect JAX-RS Applications] and xref:security-authorization.adoc[Security Authorization] guides. For more details, check the xref:security.adoc[Security guide].
ja_jp: `@RolesAllowed` アノテーションまたは `application.properties` ファイルを使用して保護されたルートを設定するには、ガイド link:security-openid-connect.html[OpenID Connect Adapter を利用してJAX-RSアプリケーションを保護] および xref:security-authorization.adoc[Securityの認可] を参照してください。詳細については、 xref:security.adoc[Securityのガイド]を確認してください。

source: To configure the schema manually please use https://infinispan.org/docs/infinispan-operator/main/operator.html[Infinispan Operator] for Kubernetes deployments, Infinispan Console, https://infinispan.org/docs/stable/titles/rest/rest.html#rest_v2_protobuf_schemas[REST API] or the https://infinispan.org/docs/stable/titles/encoding/encoding.html#registering-sci-remote-caches_marshalling[Hot Rod Java Client].
ja_jp: スキーマを手動で設定するには、Kubernetes デプロイメント用の https://infinispan.org/docs/infinispan-operator/main/operator.html[Infinispan Operator] 、Infinispan Console、 https://infinispan.org/docs/stable/titles/rest/rest.html#rest_v2_protobuf_schemas[REST API] または https://infinispan.org/docs/stable/titles/encoding/encoding.html#registering-sci-remote-caches_marshalling[Hot Rod Java Client] を使用してください。

source: To configure the schema manually please use https://infinispan.org/docs/infinispan-operator/master/operator.html[Infinispan Operator] for Kubernetes deployments, Infinispan Console, https://infinispan.org/docs/stable/titles/rest/rest.html#rest_v2_protobuf_schemas[REST API] or the https://infinispan.org/docs/stable/titles/encoding/encoding.html#registering-sci-remote-caches_marshalling[Hot Rod Java Client].
ja_jp: スキーマを手動で設定するには、 link:https://infinispan.org/docs/infinispan-operator/master/operator.html[Infinispan Operator] for Kubernetes deployments、Infinispan Console、 link:https://infinispan.org/docs/stable/titles/rest/rest.html#rest_v2_protobuf_schemas[REST API] 、または link:https://infinispan.org/docs/stable/titles/encoding/encoding.html#registering-sci-remote-caches_marshalling[Hot Rod Java Client] を使用してください。

source: To configure the timeout and redelivery backoff mechanism you can set `ackTimeoutMillis` and `ackTimeout.redeliveryBackoff` properties. The `ackTimeout.redeliveryBackoff` value accepts comma separated values of min delay in milliseconds, max delay in milliseconds and multiplier respectively:
ja_jp: タイムアウトと再配信バックオフメカニズムを設定するには、 `ackTimeoutMillis` プロパティーと `ackTimeout.redeliveryBackoff` プロパティーを設定します。 `ackTimeout.redeliveryBackoff` には、最小遅延 (ミリ秒単位)、最大遅延 (ミリ秒単位)、および乗数をコンマ区切り値として指定できます。

source: To configure the timeout for the handshake phase:
ja_jp: ハンドシェイクフェーズのタイムアウトを設定するには、次のように指定します。

source: To configure the trust store, you can use a _named_ TLS configuration stored in the xref:./tls-registry-reference.adoc[TLS registry]:
ja_jp: トラストストアを設定するには、xref:./tls-registry-reference.adoc[TLS レジストリー] に保存されている _名前付き_ TLS 設定を使用できます。

source: To configure which OIDC client should be used by the GraphQL client, select one of the configured OIDC clients with the `quarkus.oidc-client-graphql.client-name` property, for example:
ja_jp: 以下のように、GraphQL クライアントが使用する OIDC クライアントを設定するには、 `quarkus.oidc-client-graphql.client-name` プロパティーが指定された設定済みの OIDC クライアントの 1 つを選択します。

source: To configure which OIDC client the GraphQL client should use, select one of the configured OIDC clients with the `quarkus.oidc-client-graphql.client-name` property, for example:
ja_jp: GraphQL クライアントが使用すべき OIDC クライアントを設定するには、 `quarkus.oidc-client-graphql.client-name` プロパティーで設定済みの OIDC クライアントの 1 つを選択します。次に例を示します。

source: To configure your application with Pulsar Oauth2 authentication:
ja_jp: Pulsar Oauth2 認証を使用してアプリケーションを設定するには、以下のように指定します。
